bolknote/MK61S_MINI/code/shared_memory.cpp
#include "shared_memory.hpp"

#include <stdint.h>
#include <string.h>

#if defined(ARDUINO_ARCH_STM32)
#include "mpu_guard_policy.hpp"
#endif

namespace shared_memory {
namespace {

alignas(8) static u8 workspace_storage[WORKSPACE_SIZE];
alignas(8) static u8 scratch_storage[SCRATCH_SIZE];
#if MK61_SHARED_MEMORY_BULK_ENABLED
alignas(8) static u8 bulk_storage[BULK_SIZE];
#endif

#if defined(ARDUINO_ARCH_STM32)
extern "C" {
extern u8 _end;
// Official release builders export the exact free-RAM interval.  A sketch
// built directly with the stock STM32 Arduino board uses the Core linker
// script instead, so these two optional symbols legitimately resolve to 0.
extern u8 __mk61_dynamic_begin __attribute__((weak));
extern u8 __mk61_dynamic_end __attribute__((weak));
}

#if defined(STM32F411xE)
static constexpr mpu_guard_policy::Profile ACTIVE_RAM_PROFILE =
    mpu_guard_policy::F411_PROFILE;
#elif defined(STM32F401xC) || defined(STM32F401xE)
static constexpr mpu_guard_policy::Profile ACTIVE_RAM_PROFILE =
    mpu_guard_policy::F401_PROFILE;
#else
#error "dynamic shared memory supports only STM32F401/F411"
#endif

static uintptr_t exported_region_begin(void) {
  return (uintptr_t) &__mk61_dynamic_begin;
}

static uintptr_t exported_region_end(void) {
  return (uintptr_t) &__mk61_dynamic_end;
}

static bool exported_region_available(void) {
  const uintptr_t begin = exported_region_begin();
  const uintptr_t end = exported_region_end();
  return begin != 0 && end > begin;
}

static uintptr_t fallback_region_end(void) {
  return ACTIVE_RAM_PROFILE.ram_start + ACTIVE_RAM_PROFILE.ram_size -
      ACTIVE_RAM_PROFILE.stack_budget - ACTIVE_RAM_PROFILE.guard_size;
}

static uintptr_t region_begin(void) {
  if(exported_region_available()) return exported_region_begin();
  const uintptr_t begin = ((uintptr_t) &_end + 7U) & ~(uintptr_t) 7U;
  const uintptr_t end = fallback_region_end();
  // A stock linker has no ASSERT protecting this interval.  Fail closed if a
  // development configuration consumes the guarded RAM instead of allowing
  // unsigned pool-size wraparound.
  return begin <= end ? begin : end;
}

static uintptr_t region_end(void) {
  return exported_region_available()
      ? exported_region_end() : fallback_region_end();
}
#else
// Host tests exercise the same allocator against simulated SRAM. This array
// is never part of an STM32 firmware image.
#ifndef MK61_TEST_RAM_SIZE
#define MK61_TEST_RAM_SIZE 32768
#endif
alignas(32) static u8 simulated_ram[MK61_TEST_RAM_SIZE];
static uintptr_t region_begin(void) { return (uintptr_t) simulated_ram; }
static uintptr_t region_end(void) { return (uintptr_t) simulated_ram + sizeof(simulated_ram); }
#endif
static uintptr_t heap_cursor;
static constexpr usize APP_ALIGNMENT = 32; // ARMv7-M MPU minimum region

static uintptr_t pool_begin(void) {
  if(heap_cursor == 0) heap_cursor = region_begin();
  return (heap_cursor + 7U) & ~(uintptr_t) 7U;
}

static uintptr_t pool_end(void) {
  return region_end();
}

static usize pool_size(void) { return pool_end() - pool_begin(); }

struct ArenaPolicy {
  bool retain_resident;
  bool allow_nested;
  bool zero_new_owner;
};

static constexpr ArenaPolicy arena_policies[] = {
  {true, true, true},
  {false, false, false},
  {false, false, false},
  {false, false, false},
  {false, false, false}
};

static constexpr OwnerPolicy owner_policies[] = {
#define MK61_SHARED_MEMORY_OWNER(name, text, allowed, persistent, cache, evictable, schema) \
  {(u8) (allowed), (u8) (persistent), (u8) (cache), (u8) (evictable), \
   (u8) (schema)},
#include "shared_memory_owner_catalog.inc"
#undef MK61_SHARED_MEMORY_OWNER
};

static const char* const owner_names[] = {
#define MK61_SHARED_MEMORY_OWNER(name, text, allowed, persistent, cache, evictable, schema) text,
#include "shared_memory_owner_catalog.inc"
#undef MK61_SHARED_MEMORY_OWNER
};

static constexpr u8 ALL_ARENAS =
    arena_mask(Arena::WORKSPACE) |
    arena_mask(Arena::SCRATCH) |
    arena_mask(Arena::BULK) |
    arena_mask(Arena::OVERLAY) | arena_mask(Arena::APP);

static constexpr bool policy_catalog_valid(void) {
  if(sizeof(arena_policies) / sizeof(arena_policies[0]) !=
     (usize) Arena::COUNT) return false;
  if(sizeof(owner_policies) / sizeof(owner_policies[0]) !=
     (usize) Owner::COUNT) return false;
  if(owner_policies[0].allowed_arenas != 0 ||
     owner_policies[0].persistent_arenas != 0 ||
     owner_policies[0].cache_arenas != 0 ||
     owner_policies[0].evictable_arenas != 0 ||
     owner_policies[0].snapshot_schema != 0) return false;
  for(usize index = 1; index < (usize) Owner::COUNT; index++) {
    const OwnerPolicy policy = owner_policies[index];
    if(policy.allowed_arenas == 0 ||
       (policy.allowed_arenas & ~ALL_ARENAS) != 0 ||
       (policy.persistent_arenas & ~policy.allowed_arenas) != 0 ||
       (policy.cache_arenas & ~policy.allowed_arenas) != 0 ||
       (policy.evictable_arenas & ~policy.cache_arenas) != 0 ||
       (policy.persistent_arenas & policy.cache_arenas) != 0) return false;
    if(policy.snapshot_schema != 0 &&
       (policy.persistent_arenas & arena_mask(Arena::WORKSPACE)) == 0) {
      return false;
    }
    if((policy.persistent_arenas & ~arena_mask(Arena::WORKSPACE)) != 0) {
      return false;
    }
  }
  return true;
}

static_assert(policy_catalog_valid(),
              "shared-memory owner policy catalog is inconsistent");
static_assert(sizeof(owner_names) / sizeof(owner_names[0]) ==
              (usize) Owner::COUNT,
              "shared-memory owner name catalog is incomplete");

struct ArenaState {
  u8* memory;
  usize capacity;
  usize resident_size;
  usize allocated_size;
  usize high_water;
  EvictionPrepare eviction_prepare;
  Lease* eviction_lease;
  u32 token;
  u32 resident_epoch;
  u32 acquisitions;
  u32 nested_acquisitions;
  u32 releases;
  u32 busy_failures;
  u32 cache_deferrals;
  u32 invalid_failures;
  u32 owner_switches;
  u32 clears;
  u32 cleared_bytes;
  u32 reclaim_attempts;
  u32 reclaims;
  u32 reclaim_failures;
  u16 depth;
  u16 max_depth;
  Owner active;
  Owner resident;
  u8 enabled : 1;
  u8 reclaiming : 1;
  u8 discard_pending : 1;
};

#define MK61_ARENA_STATE(memory_value, capacity_value, enabled_value)       \
  {memory_value, capacity_value, 0, 0, 0, nullptr, nullptr, 0, 0,             \
   0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,                                  \
   0, 0, Owner::NONE, Owner::NONE, enabled_value, false, false}

static ArenaState arenas[] = {
  MK61_ARENA_STATE(workspace_storage, WORKSPACE_SIZE, true),
  MK61_ARENA_STATE(scratch_storage, SCRATCH_SIZE, true),
#if MK61_SHARED_MEMORY_BULK_ENABLED
  MK61_ARENA_STATE(bulk_storage, BULK_SIZE, true),
#else
  MK61_ARENA_STATE(nullptr, BULK_SIZE, false),
#endif
  MK61_ARENA_STATE(nullptr, 0, true),
  MK61_ARENA_STATE(nullptr, 0, MK61_SHARED_MEMORY_APP_ENABLED)
};

#undef MK61_ARENA_STATE

static_assert(sizeof(arenas) / sizeof(arenas[0]) == (usize) Arena::COUNT,
              "shared-memory arena table is incomplete");

static void refresh_pool(void) {
  ArenaState& prefix = arenas[(usize) Arena::OVERLAY];
  ArenaState& app = arenas[(usize) Arena::APP];
  prefix.memory = (u8*) pool_begin();
  prefix.capacity = pool_size() - app.capacity;
  app.memory = app.enabled ? (u8*) (pool_end() - app.capacity) : nullptr;
}

// Eviction is a global one-way transition, not merely a lock on one arena.
// Scanning the arena states costs no RAM and prevents a callback from
// acquiring or mutating another shared arena before the manager has revoked
// the registered lease.
static bool transition_in_progress(void) {
  for(usize index = 0; index < (usize) Arena::COUNT; index++) {
    if(arenas[index].reclaiming) return true;
  }
  return false;
}

