bolknote/MK61S_MINI/code/shared_memory.cpp
static ArenaState* state(Arena arena) {
  if(arenas[(usize) Arena::OVERLAY].memory == nullptr) refresh_pool();
  const usize index = (usize) arena;
  return index < (usize) Arena::COUNT ? &arenas[index] : nullptr;
}

static const ArenaPolicy* arena_policy(Arena arena) {
  const usize index = (usize) arena;
  return index < (usize) Arena::COUNT ? &arena_policies[index] : nullptr;
}

static bool interrupt_context(void) {
#if defined(__arm__) || defined(__thumb__)
  u32 ipsr = 0;
  __asm__ volatile ("mrs %0, ipsr" : "=r" (ipsr));
  return ipsr != 0;
#else
  return false;
#endif
}

static void increment(u32& counter) {
  if(counter != UINT32_MAX) counter++;
}

static void note_invalid(ArenaState* arena) {
  if(arena != nullptr) increment(arena->invalid_failures);
}

static void add(u32& counter, usize value) {
  if(value >= UINT32_MAX || counter > UINT32_MAX - (u32) value) {
    counter = UINT32_MAX;
  } else {
    counter += (u32) value;
  }
}

static void advance_resident_epoch(ArenaState& arena) {
  // Epoch is an identity, not a statistic: it must keep changing after the
  // diagnostic counters have saturated. Zero remains reserved for "none".
  arena.resident_epoch++;
  if(arena.resident_epoch == 0) arena.resident_epoch = 1;
}

static void clear_resident(ArenaState& arena) {
  if(arena.resident != Owner::NONE || arena.resident_size != 0) {
    arena.resident = Owner::NONE;
    arena.resident_size = 0;
    advance_resident_epoch(arena);
  }
}

} // namespace

void* adjust_heap(i32 increment) {
  ArenaState& prefix = *state(Arena::OVERLAY);
  const ArenaState& app = *state(Arena::APP);
  if(interrupt_context() || transition_in_progress() ||
     (increment != 0 && prefix.allocated_size != 0)) return nullptr;
  const uintptr_t previous = heap_cursor;
  // Compute the magnitude without negating INT32_MIN.
  const u32 magnitude = increment < 0 ? 0U - (u32) increment : (u32) increment;
  if(increment < 0) {
    if(magnitude > previous - region_begin()) return nullptr;
    heap_cursor -= magnitude;
  } else {
    if(magnitude > pool_end() - app.capacity - previous) return nullptr;
    heap_cursor += magnitude;
  }
  refresh_pool();
  return (void*) previous;
}

OwnerPolicy owner_policy(Owner owner) {
  const usize index = (usize) owner;
  if(index >= (usize) Owner::COUNT) {
    const OwnerPolicy invalid = {};
    return invalid;
  }
  return owner_policies[index];
}

bool owner_allowed(Arena arena, Owner owner) {
  return owner != Owner::NONE && owner < Owner::COUNT &&
         (owner_policy(owner).allowed_arenas & arena_mask(arena)) != 0;
}

bool owner_persistent(Arena arena, Owner owner) {
  return owner != Owner::NONE && owner < Owner::COUNT &&
         (owner_policy(owner).persistent_arenas & arena_mask(arena)) != 0;
}

bool owner_cache_allowed(Arena arena, Owner owner) {
  return owner != Owner::NONE && owner < Owner::COUNT &&
         (owner_policy(owner).cache_arenas & arena_mask(arena)) != 0;
}

bool owner_evictable(Arena arena, Owner owner) {
  return owner != Owner::NONE && owner < Owner::COUNT &&
         (owner_policy(owner).evictable_arenas & arena_mask(arena)) != 0;
}

u8 owner_snapshot_schema(Owner owner) {
  return owner != Owner::NONE && owner < Owner::COUNT
      ? owner_policy(owner).snapshot_schema : 0;
}

bool detail_try_reclaim(Arena arena_id) {
  ArenaState* const arena = state(arena_id);
  if(arena == nullptr || arena->active == Owner::NONE ||
     arena->eviction_prepare == nullptr || arena->eviction_lease == nullptr ||
     transition_in_progress() || arena->depth != 1) return false;
  increment(arena->reclaim_attempts);
  arena->reclaiming = true;
  const EvictionPrepare prepare = arena->eviction_prepare;
  Lease* const registered = arena->eviction_lease;
  const EvictionDecision decision = prepare();
  bool released = false;
  if(decision == EvictionDecision::RELEASE &&
     arena->active != Owner::NONE && arena->depth == 1 &&
     arena->eviction_lease == registered) {
    registered->revoke_from_manager();
    released = arena->active == Owner::NONE && arena->depth == 0;
  }
  arena->reclaiming = false;
  if(released) {
    increment(arena->reclaims);
    return true;
  }
  increment(arena->reclaim_failures);
  return false;
}

Lease::Lease(Arena arena, Owner owner, usize required) : Lease() {
  (void) acquire(arena, owner, required);
}

Lease::~Lease(void) {
  reset();
}

bool Lease::acquire(Arena next_arena, Owner next_owner,
                    usize required) {
  return acquire_impl(next_arena, next_owner, required, false);
}

bool Lease::acquire_cache(Arena next_arena, Owner next_owner,
                          usize required) {
  return acquire_impl(next_arena, next_owner, required, true);
}

bool Lease::acquire_impl(Arena next_arena, Owner next_owner,
                         usize required, bool opportunistic) {
  ArenaState* const arena = state(next_arena);
  const ArenaPolicy* const policy = arena_policy(next_arena);
  if(arena == nullptr || !arena->enabled || next_owner == Owner::NONE ||
     next_owner >= Owner::COUNT || required == 0 ||
     required > (next_arena == Arena::APP ? APP_MAX_SIZE :
                 next_arena == Arena::OVERLAY ? pool_size() :
                 arena == nullptr ? 0 : arena->capacity) || policy == nullptr ||
     !owner_allowed(next_arena, next_owner) ||
     (opportunistic && !owner_cache_allowed(next_arena, next_owner)) ||
     interrupt_context()) {
    note_invalid(arena);
    return false;
  }

  if(memory_ != nullptr) {
    return arena_ == next_arena && owner_ == next_owner &&
           required <= requested_;
  }

  // Eviction preparation is a one-way, non-reentrant hand-off. The callback
  // cannot acquire this arena; on RELEASE the manager revokes the old lease.
  if(transition_in_progress()) {
    increment(arena->invalid_failures);
    return false;
  }

  if(arena->active != Owner::NONE && arena->active != next_owner) {
    if(!detail_try_reclaim(next_arena)) {
      increment(opportunistic ? arena->cache_deferrals
                              : arena->busy_failures);
      return false;
    }
  }

  if(opportunistic && arena->active == Owner::NONE &&
     policy->retain_resident && arena->resident != Owner::NONE &&
     arena->resident != next_owner) {
    increment(arena->cache_deferrals);
    return false;
  }

  // APP occupies the top; normal OVERLAY clients retain a stable bottom.
  if(arena->active == Owner::NONE &&
     (next_arena == Arena::APP || next_arena == Arena::OVERLAY)) {
    const Arena peer_id = next_arena == Arena::APP ? Arena::OVERLAY : Arena::APP;
    ArenaState& peer = *state(peer_id);
    const usize alignment = next_arena == Arena::APP ? APP_ALIGNMENT : 8U;
    const usize aligned = (required + alignment - 1U) & ~(alignment - 1U);
    const usize peer_size = peer_id == Arena::APP ? peer.capacity :
        (peer.allocated_size + 7U) & ~(usize) 7U;
    if(aligned > pool_size() - peer_size) {
      // Loading a movable APP never discards a live lower buffer, even an
      // evictable cache. Its existing address and contents remain stable.
      if(
         next_arena == Arena::APP ||
         !detail_try_reclaim(peer_id)) {
        increment(opportunistic ? arena->cache_deferrals : arena->busy_failures);
        return false;
      }
    }
    if(next_arena == Arena::APP) {
      arena->capacity = aligned;
      refresh_pool();
    }
  }

  bool is_nested = false;
  bool is_fresh = true;
  if(arena->active == next_owner) {
    if(!policy->allow_nested || arena->depth == 0 ||
       arena->depth == 0xFFFFU || arena->eviction_prepare != nullptr ||
       required > arena->resident_size) {
      increment(arena->busy_failures);
      return false;
    }
    arena->depth++;
    increment(arena->nested_acquisitions);
    is_nested = true;
    is_fresh = false;
  } else {
    if(policy->retain_resident) {
      is_fresh = arena->resident != next_owner;
      if(is_fresh) {
        if(arena->resident != Owner::NONE) increment(arena->owner_switches);
        arena->resident = next_owner;
        arena->resident_size = 0;
      }
      if(required > arena->resident_size && policy->zero_new_owner) {
        memset(arena->memory + arena->resident_size, 0,
               required - arena->resident_size);
        increment(arena->clears);
        add(arena->cleared_bytes, required - arena->resident_size);
      }
      if(required > arena->resident_size) arena->resident_size = required;
    } else {
      arena->resident = Owner::NONE;
      arena->resident_size = 0;
      is_fresh = true;
    }

    arena->allocated_size = required;
    arena->active = next_owner;
    arena->depth = 1;
    arena->token++;
    if(arena->token == 0) arena->token++;
    if(policy->retain_resident) advance_resident_epoch(*arena);
    increment(arena->acquisitions);
  }

  if(required > arena->high_water) arena->high_water = required;
  if(arena->depth > arena->max_depth) arena->max_depth = arena->depth;

