bolknote/MK61S_MINI/code/shared_memory.cpp
  arena_ = next_arena;
  owner_ = next_owner;
  memory_ = arena->memory;
  requested_ = required;
  token_ = arena->token;
  fresh_ = is_fresh;
  nested_ = is_nested;
  return true;
}

void Lease::reset(void) {
  release_impl(false);
}

void Lease::release_impl(bool from_manager) {
  if(memory_ == nullptr) return;
  ArenaState* const arena = state(arena_);
  const ArenaPolicy* const policy = arena_policy(arena_);
  if(arena == nullptr || arena->active != owner_ || arena->depth == 0 ||
     arena->token != token_ || arena->memory != memory_ || policy == nullptr ||
     (transition_in_progress() && !from_manager) ||
     (from_manager && (!arena->reclaiming || nested_ || arena->depth != 1 ||
                       arena->eviction_lease != this))) {
    __builtin_trap();
  }
  arena->depth--;
  increment(arena->releases);
  if(arena->depth == 0) {
    arena->allocated_size = 0;
    if(arena_ == Arena::APP) {
      arena->capacity = 0;
      refresh_pool();
    }
    arena->active = Owner::NONE;
    arena->eviction_prepare = nullptr;
    arena->eviction_lease = nullptr;
    if(policy->retain_resident &&
       (arena->discard_pending ||
        !owner_persistent(arena_, owner_))) {
      clear_resident(*arena);
    }
    arena->discard_pending = false;
  }
  arena_ = Arena::COUNT;
  owner_ = Owner::NONE;
  memory_ = nullptr;
  requested_ = 0;
  token_ = 0;
  fresh_ = false;
  nested_ = false;
}

void Lease::revoke_from_manager(void) {
  release_impl(true);
}

bool Lease::set_evictable(EvictionPrepare prepare) {
  if(memory_ == nullptr || nested_ || prepare == nullptr ||
     !owner_evictable(arena_, owner_)) return false;
  ArenaState* const arena = state(arena_);
  if(arena == nullptr || arena->active != owner_ || arena->depth != 1 ||
     arena->token != token_ || arena->eviction_prepare != nullptr ||
     transition_in_progress()) return false;
  arena->eviction_prepare = prepare;
  arena->eviction_lease = this;
  return true;
}

bool Lease::mark_restored(void) {
  if(memory_ == nullptr || nested_ || !fresh_ ||
     transition_in_progress()) return false;
  const ArenaState* const arena = state(arena_);
  if(arena == nullptr || arena->active != owner_ || arena->depth != 1 ||
     arena->token != token_ || arena->memory != memory_) return false;
  fresh_ = false;
  return true;
}

usize capacity(Arena arena) {
  const ArenaState* const value = state(arena);
  return value == nullptr ? 0 : value->capacity;
}

bool enabled(Arena arena) {
  const ArenaState* const value = state(arena);
  return value != nullptr && value->enabled;
}

Owner active_owner(Arena arena) {
  const ArenaState* const value = state(arena);
  return value == nullptr ? Owner::NONE : value->active;
}

Owner resident_owner(Arena arena) {
  const ArenaState* const value = state(arena);
  return value == nullptr ? Owner::NONE : value->resident;
}

ResidentToken resident_token(Arena arena) {
  const ArenaState* const value = state(arena);
  const ArenaPolicy* const policy = arena_policy(arena);
  if(value == nullptr || policy == nullptr || !value->enabled ||
     !policy->retain_resident || value->active != Owner::NONE ||
     value->resident == Owner::NONE || value->resident_size == 0 ||
     value->resident_epoch == 0 || transition_in_progress() ||
     interrupt_context()) return ResidentToken();
  return ResidentToken(arena, value->resident, value->resident_size,
                       value->resident_epoch);
}

bool commit_resident_handoff(const ResidentToken& token) {
  ArenaState* const value = state(token.arena_);
  const ArenaPolicy* const policy = arena_policy(token.arena_);
  if(!token.valid() || value == nullptr || policy == nullptr ||
     !value->enabled || !policy->retain_resident ||
     value->active != Owner::NONE || value->resident != token.owner_ ||
     value->resident_size != token.size_ ||
     value->resident_epoch != token.epoch_ || transition_in_progress() ||
     interrupt_context()) {
    note_invalid(value);
    return false;
  }
  clear_resident(*value);
  value->discard_pending = false;
  return true;
}

bool discard_resident(Arena arena, Owner owner) {
  ArenaState* const value = state(arena);
  if(value == nullptr || !value->enabled || owner == Owner::NONE ||
     owner >= Owner::COUNT || !owner_allowed(arena, owner) ||
     interrupt_context() || transition_in_progress()) {
    note_invalid(value);
    return false;
  }
  // Cancellation and cleanup paths are intentionally repeatable. An absent
  // resident is already in the requested state and must not pollute the
  // invalid-operation counter on every unrelated terminal command.
  if(value->resident != owner && value->active != owner) return true;
  if(value->resident != owner ||
     (value->active != Owner::NONE && value->active != owner)) {
    note_invalid(value);
    return false;
  }
  if(value->active == owner) {
    value->discard_pending = true;
  } else {
    clear_resident(*value);
    value->discard_pending = false;
  }
  return true;
}

void* data(Arena arena, Owner owner) {
  ArenaState* const value = state(arena);
  return value != nullptr && owner != Owner::NONE &&
         value->active == owner && value->depth != 0
      ? value->memory : nullptr;
}

bool contains(Arena arena, const void* pointer, usize size) {
  const ArenaState* const value = state(arena);
  if(value == nullptr || !value->enabled || value->memory == nullptr ||
     pointer == nullptr || size == 0) return false;
  const uintptr_t begin = (uintptr_t) value->memory;
  const uintptr_t probe = (uintptr_t) pointer;
  if(value->capacity > UINTPTR_MAX - begin || probe < begin ||
     size > UINTPTR_MAX - probe) return false;
  return probe + size <= begin + value->capacity;
}

Snapshot snapshot(Arena arena) {
  const ArenaState* const value = state(arena);
  if(value == nullptr) {
    const Snapshot empty = {};
    return empty;
  }
  const Snapshot result = {
    arena,
    value->capacity,
    value->resident_size,
    value->resident_epoch,
    value->high_water,
    value->active,
    value->resident,
    value->depth,
    value->max_depth,
    value->acquisitions,
    value->nested_acquisitions,
    value->releases,
    value->busy_failures,
    value->cache_deferrals,
    value->invalid_failures,
    value->owner_switches,
    value->clears,
    value->cleared_bytes,
    value->reclaim_attempts,
    value->reclaims,
    value->reclaim_failures,
    value->enabled != 0,
    value->eviction_prepare != nullptr
  };
  return result;
}

bool validate_invariants(void) {
  (void) state(Arena::OVERLAY);
  if(region_begin() > heap_cursor || pool_begin() > pool_end() ||
     (pool_end() & (APP_ALIGNMENT - 1U)) != 0) return false;
  const usize physical_size = region_end() - region_begin();
  usize reclaiming_count = 0;
  for(usize index = 0; index < (usize) Arena::COUNT; index++) {
    const Arena arena_id = (Arena) index;
    const ArenaState& arena = arenas[index];
    const ArenaPolicy& policy = arena_policies[index];
    if(arena.reclaiming) reclaiming_count++;
    const usize physical_limit = (arena_id == Arena::APP || arena_id == Arena::OVERLAY)
        ? physical_size : arena.capacity;
    if((arena.capacity == 0 && arena_id != Arena::APP && arena_id != Arena::OVERLAY) ||
       arena.high_water > physical_limit || arena.allocated_size > arena.capacity ||
       ((arena.allocated_size == 0) != (arena.depth == 0)) ||
       arena.high_water < arena.resident_size ||
       arena.max_depth < arena.depth ||
       (arena.enabled && arena.memory == nullptr) ||
       (!arena.enabled && arena.memory != nullptr) ||
       ((arena.active == Owner::NONE) != (arena.depth == 0)) ||
       ((arena.resident == Owner::NONE) != (arena.resident_size == 0)) ||
       (arena.resident_size > arena.capacity) ||
       (!policy.retain_resident &&
        (arena.resident != Owner::NONE || arena.resident_size != 0)) ||
       ((arena.eviction_prepare == nullptr) !=
        (arena.eviction_lease == nullptr))) return false;
    if(!arena.enabled &&
       (arena.active != Owner::NONE || arena.resident != Owner::NONE ||
        arena.depth != 0 || arena.eviction_prepare != nullptr ||
        arena.reclaiming || arena.discard_pending)) return false;
    if(arena.active != Owner::NONE) {
      if(!owner_allowed(arena_id, arena.active) || arena.token == 0 ||
         arena.depth == 0) return false;
      if(policy.retain_resident &&
         (arena.resident != arena.active || arena.resident_size == 0 ||
          arena.resident_epoch == 0)) return false;
    } else if(arena.resident != Owner::NONE &&
              !owner_persistent(arena_id, arena.resident)) {
      return false;
    }
    if(arena.eviction_prepare != nullptr &&
       (arena.active == Owner::NONE || arena.depth != 1 ||
        !owner_evictable(arena_id, arena.active))) return false;
    if(arena.discard_pending &&
       (arena.active == Owner::NONE || arena.resident != arena.active ||
        !policy.retain_resident)) return false;
    if(arena.reclaiming && arena.eviction_prepare == nullptr) return false;
  }
  const ArenaState& app = *state(Arena::APP);
  const ArenaState& prefix = *state(Arena::OVERLAY);
  if(prefix.capacity + app.capacity != pool_size() ||
     (uintptr_t) prefix.memory != pool_begin() ||
     (app.enabled && (uintptr_t) app.memory != pool_end() - app.capacity)) return false;
  return reclaiming_count <= 1;
}

void reset_statistics(void) {
  for(usize index = 0; index < (usize) Arena::COUNT; index++) {
    ArenaState& arena = arenas[index];
    // Inactive persistent bytes still occupy the arena and therefore form the
    // correct baseline for a new high-water measurement interval.
    arena.high_water = arena.resident_size;
    arena.max_depth = arena.depth;
    arena.acquisitions = 0;
    arena.nested_acquisitions = 0;
    arena.releases = 0;
    arena.busy_failures = 0;
    arena.cache_deferrals = 0;
    arena.invalid_failures = 0;
    arena.owner_switches = 0;
    arena.clears = 0;
    arena.cleared_bytes = 0;
    arena.reclaim_attempts = 0;
    arena.reclaims = 0;
    arena.reclaim_failures = 0;
  }
}

const char* arena_name(Arena arena) {
  switch(arena) {
    case Arena::WORKSPACE: return "workspace";
    case Arena::SCRATCH: return "scratch";
    case Arena::BULK: return "bulk";
    case Arena::OVERLAY: return "overlay";
    case Arena::APP: return "app";
    case Arena::COUNT: break;
  }
  return "invalid";
}

const char* owner_name(Owner owner) {
  const usize index = (usize) owner;
  return index < (usize) Owner::COUNT ? owner_names[index] : "invalid";
}

} // namespace shared_memory

#if defined(ARDUINO_ARCH_STM32)
#include <errno.h>
#undef errno
extern int errno;

// Override STM32 Core's weak _sbrk, which only knows the current MSP and
// would otherwise allocate straight through a loaded APP or the MPU guard.
extern "C" char* _sbrk(int increment) {
  void* const result = shared_memory::adjust_heap(increment);
  if(result != nullptr) return (char*) result;
  errno = ENOMEM;
  return (char*) -1;
}
#endif
